content/emacs/modes/rtags.org
# -*- coding:utf-8-*-
#+TITLE:RTags 使用
#+AUTHOR: liushangliang
#+EMAIL: phenix3443+github@gmail.com
#+STARTUP: overview

本文是对 Github 上 RTags [[https://github.com/Andersbakken/rtags][README]] 文档的翻译。

* 简介
  RTags is a client/server application that indexes C/C++ code and keeps a persistent file-based database of references, declarations, definitions, symbolnames etc. There’s also limited support for ObjC/ObjC++. It allows you to find symbols by name (including nested class and namespace scope). Most importantly we give you proper follow-symbol and find-references support. We also have neat little things like rename-symbol, integration with clang’s “fixits” (http://clang.llvm.org/diagnostics.html). We also integrate with flymake using clang’s vastly superior errors and warnings. Since RTags constantly will reindex “dirty” files you get live updates of compiler errors and warnings. Since we already know how to compile your sources we have a way to quickly bring up the preprocessed output of the current source file in a buffer.

  RTags 是一个客户端/服务器应用程序，它可以索引 C/C++代码，并将引用、声明、定义、符号名等保留到一个基于文件的数据库中。也有限支持 ObjC/OjbC++。可以通过名字查找符号（包括嵌套的类和命名空间）。更重要的是支持合适的后续付豪和引用查找。还有一些小功能，比如重命名符号，与 clang 的“fixits”集成（http://clang.llvm.org/diagnostics.html）。 还将 clang 处理错误为和警告方面的优势与 flymake 整合在一起。RTags 不断重新索引“脏”文件，因而会收到编译器错误和警告的实时更新。由于我们已经知道如何编译源代码，因此我们可以快速将当前源文件的预处理输出显示在缓冲区中。

  While existing taggers like gnu global, cscope, etags, ctags etc do a decent job for C they often fall a little bit short for C++. With its incredible lexical complexity, parsing C++ is an incredibly hard task and we make no bones about the fact that the only reason we are able to improve on the current tools is because of clang (http://clang.llvm.org/). RTags is named RTags in recognition of Roberto Raggi on whose C++ parser we intended to base this project but he assured us clang was the way to go. The name stuck though.

  虽然其他已有的标签工具，如 gnu global，cscope，etags，ctags 等可以很好的处理 C，但是 C++就要差一点。由于 C++难以置信的词法复杂性，解析 C++是一项困难至极的任务，我们能不顾这个事实，在当前工具上作出改进的唯一原因是 clang(http://clang.llvm.org/)。RTags 名字是也出于对 Roberto Raggi 的认同，我们计划基于它的 C++解析器构建该项目，但是他向我们保证 clang 是一条可行的路。

* 快速入门
** 编译 Rtags
  #+BEGIN_SRC sh
git clone --recursive https://github.com/Andersbakken/rtags.git
cd rtags
cmake -DCMAKE_EXPORT_COMPILE_COMMANDS=1 .
make
  #+END_SRC
** 启动 rtags daemon（rdm）
   #+BEGIN_SRC sh
./bin/rdm &
   #+END_SRC

** 索引 rtags 项目
   #+BEGIN_SRC sh
./bin/rc -J .
   #+END_SRC

** 使用 Emacs 打开文件
   #+BEGIN_SRC sh
emacs +73:34 src/rdm.cpp
   #+END_SRC


** Load rtags.el
   #+BEGIN_EXAMPLE
M-: (load-file "rtags.el") RET
   #+END_EXAMPLE

** 确保能找到 rc
   #+BEGIN_EXAMPLE
M-x set-variable RET rtags-path RET "../bin" RET
   #+END_EXAMPLE

** 调用 rtags-find-symbol-at-point
   #+BEGIN_EXAMPLE
M-x rtags-find-symbol-at-point RET
   #+END_EXAMPLE

   当前未知就是 =Server::instance()= 的定义。

* 安装
  参见 [[https://github.com/Andersbakken/rtags#installing-rtags][官方说明]]

* Setup

  rdm runs in the background and monitors all your indexed files for changes, and reindexes when a source file or one of its dependencies is modified. Since clang is a fully compliant compiler it needs specific information about how your sources are compiled to be able to properly index them. This is done through telling rdm about the compile line like this:

  运行在后台的 rdm 监控所有索引文件的更改，当一个源码文件或者它的依赖修改后它会重新索引。因为 clang 是一个完全兼容的编译器，需要知道如何编译源码的特定信息才能正确的索引它们。这通过如下的编译行来告诉 rdm：

  #+BEGIN_EXAMPLE
  rc -c gcc -I... -fsomeflag -c foobar.c
  rc -J /path/to/a/directory/containing/compile_commands.json
  #+END_EXAMPLE

  You can generate a =compile_commands.json= with various different tools, one might fit better than the other, depending on your project build system.

  可以使用各种工具生成 compile_commands.json，工具的选择取决于项目的构建系统：

** ninja

   #+BEGIN_SRC sh
ninja -t compdb cxx cc > compile_commands.json
rc -J
   #+END_SRC
   With ninja it’s also possible to pipe the commands directly to rc.

   使用 ninja 可以使用管道命令直接输出到 rc。

   #+BEGIN_SRC sh
ninja -t commands | rc -c -
# Parse commands for a specific target only
ninja -t commands rdm | rc -c -
   #+END_SRC

** cmake

   cmake can generate a compile_commands.json file as well.

   cmake 也能生成 compile_commands.json。

   #+BEGIN_SRC sh
cmake -DCMAKE_EXPORT_COMPILE_COMMANDS=1 .
rc -J
   #+END_SRC

** Bear

   For other projects you can use bear to generate a compile_commands.json file. However, if you are cross-compiling you probably need to adjust the command entries in the compile_commands.json file to match the correct compiler. Furthermore, make sure you clean your project before invoking bear.

   对于其他项目也可以使用 bear 生成 compile_commands.json 文件。然而，交叉编译可能需要调整 compile_command.json 文件中的命令条目来匹配正确的编译器。此外，调用 bear 之前确保清理了工程。

   #+BEGIN_SRC sh
make clean
bear make
rc -J
# Parse commands for a specific target only
make clean
bear make rdm
rc -J
   #+END_SRC

