emacs/modes/rtags.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-03-05 四 17:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>RTags 使用</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="liushangliang" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">RTags 使用</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9684f46">1. 简介</a></li>
<li><a href="#org96864bb">2. 快速入门</a>
<ul>
<li><a href="#orgf4439be">2.1. 编译 Rtags</a></li>
<li><a href="#orgcf6733b">2.2. 启动 rtags daemon（rdm）</a></li>
<li><a href="#orgab5abe3">2.3. 索引 rtags 项目</a></li>
<li><a href="#orgc12a601">2.4. 使用 Emacs 打开文件</a></li>
<li><a href="#org89d1b9a">2.5. Load rtags.el</a></li>
<li><a href="#orgadf890d">2.6. 确保能找到 rc</a></li>
<li><a href="#org59d5644">2.7. 调用 rtags-find-symbol-at-point</a></li>
</ul>
</li>
<li><a href="#org37cd5e7">3. 安装</a></li>
<li><a href="#org210182b">4. Setup</a>
<ul>
<li><a href="#orgbf9fd3f">4.1. ninja</a></li>
<li><a href="#orgc2c3771">4.2. cmake</a></li>
<li><a href="#org7a8cc66">4.3. Bear</a></li>
<li><a href="#org128062a">4.4. make</a></li>
<li><a href="#orgc2a90cc">4.5. Integration with systemd (GNU Linux)</a></li>
</ul>
</li>
<li><a href="#org527ba38">5. 使用</a></li>
<li><a href="#orgf7a383d">6. Elisp</a>
<ul>
<li><a href="#orgf0a74f2">6.1. Functions</a></li>
</ul>
</li>
<li><a href="#org24e751e">7. Variables</a>
<ul>
<li><a href="#orgcf407cc">7.1. rtags-path</a></li>
<li><a href="#org911577c">7.2. rtags-jump-to-first-match</a></li>
<li><a href="#orgf1ce764">7.3. rtags-find-file-case-insensitive</a></li>
<li><a href="#org7dd9748">7.4. rtags-find-file-prefer-exact-match</a></li>
</ul>
</li>
<li><a href="#org93f018b">8. Fall back to other taggers（回退到其他 tagger）</a></li>
<li><a href="#orgfee93d2">9. Code Completion in Emacs:（代码补全）</a></li>
<li><a href="#orge2e9d87">10. RTags Flycheck integration</a>
<ul>
<li><a href="#org1df1fac">10.1. Optional</a></li>
</ul>
</li>
<li><a href="#org791390d">11. Debugging RTags（调试 RTags）</a></li>
<li><a href="#orgf3e85b9">12. Support for other editors（支持其他编辑器）</a></li>
<li><a href="#orgab9eb04">13. Disclaimer（免责声明）</a></li>
</ul>
</div>
</div>
<p>
本文是对 Github 上 RTags <a href="https://github.com/Andersbakken/rtags">README</a> 文档的翻译。
</p>

<div id="outline-container-org9684f46" class="outline-2">
<h2 id="org9684f46"><span class="section-number-2">1</span> 简介</h2>
<div class="outline-text-2" id="text-1">
<p>
RTags is a client/server application that indexes C/C++ code and keeps a persistent file-based database of references, declarations, definitions, symbolnames etc. There’s also limited support for ObjC/ObjC++. It allows you to find symbols by name (including nested class and namespace scope). Most importantly we give you proper follow-symbol and find-references support. We also have neat little things like rename-symbol, integration with clang’s “fixits” (<a href="http://clang.llvm.org/diagnostics.html">http://clang.llvm.org/diagnostics.html</a>). We also integrate with flymake using clang’s vastly superior errors and warnings. Since RTags constantly will reindex “dirty” files you get live updates of compiler errors and warnings. Since we already know how to compile your sources we have a way to quickly bring up the preprocessed output of the current source file in a buffer.
</p>

<p>
RTags 是一个客户端/服务器应用程序，它可以索引 C/C++代码，并将引用、声明、定义、符号名等保留到一个基于文件的数据库中。也有限支持 ObjC/OjbC++。可以通过名字查找符号（包括嵌套的类和命名空间）。更重要的是支持合适的后续付豪和引用查找。还有一些小功能，比如重命名符号，与 clang 的“fixits”集成（<a href="http://clang.llvm.org/diagnostics.html">http://clang.llvm.org/diagnostics.html</a>）。 还将 clang 处理错误为和警告方面的优势与 flymake 整合在一起。RTags 不断重新索引“脏”文件，因而会收到编译器错误和警告的实时更新。由于我们已经知道如何编译源代码，因此我们可以快速将当前源文件的预处理输出显示在缓冲区中。
</p>

<p>
While existing taggers like gnu global, cscope, etags, ctags etc do a decent job for C they often fall a little bit short for C++. With its incredible lexical complexity, parsing C++ is an incredibly hard task and we make no bones about the fact that the only reason we are able to improve on the current tools is because of clang (<a href="http://clang.llvm.org/">http://clang.llvm.org/</a>). RTags is named RTags in recognition of Roberto Raggi on whose C++ parser we intended to base this project but he assured us clang was the way to go. The name stuck though.
</p>

<p>
虽然其他已有的标签工具，如 gnu global，cscope，etags，ctags 等可以很好的处理 C，但是 C++就要差一点。由于 C++难以置信的词法复杂性，解析 C++是一项困难至极的任务，我们能不顾这个事实，在当前工具上作出改进的唯一原因是 clang(<a href="http://clang.llvm.org/">http://clang.llvm.org/</a>)。RTags 名字是也出于对 Roberto Raggi 的认同，我们计划基于它的 C++解析器构建该项目，但是他向我们保证 clang 是一条可行的路。
</p>
</div>
</div>

<div id="outline-container-org96864bb" class="outline-2">
<h2 id="org96864bb"><span class="section-number-2">2</span> 快速入门</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgf4439be" class="outline-3">
<h3 id="orgf4439be"><span class="section-number-3">2.1</span> 编译 Rtags</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-sh">git clone --recursive https://github.com/Andersbakken/rtags.git
<span style="color: #d18aff;">cd</span> rtags
cmake -DCMAKE_EXPORT_COMPILE_COMMANDS=1 .
make
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcf6733b" class="outline-3">
<h3 id="orgcf6733b"><span class="section-number-3">2.2</span> 启动 rtags daemon（rdm）</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-sh">./bin/rdm &amp;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgab5abe3" class="outline-3">
<h3 id="orgab5abe3"><span class="section-number-3">2.3</span> 索引 rtags 项目</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-sh">./bin/rc -J .
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc12a601" class="outline-3">
<h3 id="orgc12a601"><span class="section-number-3">2.4</span> 使用 Emacs 打开文件</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">
<pre class="src src-sh">emacs +73:34 src/rdm.cpp
</pre>
</div>
</div>
</div>


<div id="outline-container-org89d1b9a" class="outline-3">
<h3 id="org89d1b9a"><span class="section-number-3">2.5</span> Load rtags.el</h3>
<div class="outline-text-3" id="text-2-5">
<pre class="example">
M-: (load-file "rtags.el") RET
</pre>
</div>
</div>

<div id="outline-container-orgadf890d" class="outline-3">
<h3 id="orgadf890d"><span class="section-number-3">2.6</span> 确保能找到 rc</h3>
<div class="outline-text-3" id="text-2-6">
<pre class="example">
M-x set-variable RET rtags-path RET "../bin" RET
</pre>
</div>
</div>

<div id="outline-container-org59d5644" class="outline-3">
<h3 id="org59d5644"><span class="section-number-3">2.7</span> 调用 rtags-find-symbol-at-point</h3>
<div class="outline-text-3" id="text-2-7">
<pre class="example">
M-x rtags-find-symbol-at-point RET
</pre>

<p>
当前未知就是 <code>Server::instance()</code> 的定义。
</p>
</div>
</div>
</div>

<div id="outline-container-org37cd5e7" class="outline-2">
<h2 id="org37cd5e7"><span class="section-number-2">3</span> 安装</h2>
<div class="outline-text-2" id="text-3">
<p>
参见 <a href="https://github.com/Andersbakken/rtags#installing-rtags">官方说明</a>
</p>
</div>
</div>

<div id="outline-container-org210182b" class="outline-2">
<h2 id="org210182b"><span class="section-number-2">4</span> Setup</h2>
<div class="outline-text-2" id="text-4">
<p>
rdm runs in the background and monitors all your indexed files for changes, and reindexes when a source file or one of its dependencies is modified. Since clang is a fully compliant compiler it needs specific information about how your sources are compiled to be able to properly index them. This is done through telling rdm about the compile line like this:
</p>

<p>
运行在后台的 rdm 监控所有索引文件的更改，当一个源码文件或者它的依赖修改后它会重新索引。因为 clang 是一个完全兼容的编译器，需要知道如何编译源码的特定信息才能正确的索引它们。这通过如下的编译行来告诉 rdm：
</p>

<pre class="example">
  rc -c gcc -I... -fsomeflag -c foobar.c
  rc -J /path/to/a/directory/containing/compile_commands.json
</pre>

<p>
You can generate a <code>compile_commands.json</code> with various different tools, one might fit better than the other, depending on your project build system.
</p>

<p>
可以使用各种工具生成 compile_commands.json，工具的选择取决于项目的构建系统：
</p>
</div>

<div id="outline-container-orgbf9fd3f" class="outline-3">
<h3 id="orgbf9fd3f"><span class="section-number-3">4.1</span> ninja</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre class="src src-sh">ninja -t compdb cxx cc &gt; compile_commands.json
rc -J
</pre>
</div>
<p>
With ninja it’s also possible to pipe the commands directly to rc.
</p>

<p>
使用 ninja 可以使用管道命令直接输出到 rc。
</p>

<div class="org-src-container">
<pre class="src src-sh">ninja -t commands | rc -c -
<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Parse commands for a specific target only</span>
ninja -t commands rdm | rc -c -
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc2c3771" class="outline-3">
<h3 id="orgc2c3771"><span class="section-number-3">4.2</span> cmake</h3>
<div class="outline-text-3" id="text-4-2">
<p>
cmake can generate a compile_commands.json file as well.
</p>

<p>
cmake 也能生成 compile_commands.json。
</p>

<div class="org-src-container">
<pre class="src src-sh">cmake -DCMAKE_EXPORT_COMPILE_COMMANDS=1 .
rc -J
</pre>
</div>
</div>
</div>

<div id="outline-container-org7a8cc66" class="outline-3">
<h3 id="org7a8cc66"><span class="section-number-3">4.3</span> Bear</h3>
<div class="outline-text-3" id="text-4-3">
<p>
For other projects you can use bear to generate a compile_commands.json file. However, if you are cross-compiling you probably need to adjust the command entries in the compile_commands.json file to match the correct compiler. Furthermore, make sure you clean your project before invoking bear.
</p>

<p>
对于其他项目也可以使用 bear 生成 compile_commands.json 文件。然而，交叉编译可能需要调整 compile_command.json 文件中的命令条目来匹配正确的编译器。此外，调用 bear 之前确保清理了工程。
</p>

<div class="org-src-container">
<pre class="src src-sh">make clean
bear make
rc -J
<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Parse commands for a specific target only</span>
make clean
bear make rdm
rc -J
</pre>
</div>
</div>
</div>
