content/emacs/modes/rtags.org
** make

   You can ask make to only print the recipes without actually doing something. This way may be perfectly fine for not too complex Makefiles.

   可以让 make 只打印信息而不执行任何事情。这种方式可能对于不是很复杂的 makefile 有用。

   #+BEGIN_SRC sh
make clean
make -nk | rc -c -
   #+END_SRC

   There are very likely similar things you can do with other build systems that we’re unfamiliar with, please let us know if you do.

   其他一些我们不熟悉的构建系统很可能做类似的事情，如果愿意的话，请告诉我们。

   A different approach to get your files indexed is the man-in-the-middle

   索引文件的另一种方法是中间人，可以这样做：

   #+BEGIN_SRC sh
ln -s /path/to/rtags/bin/gcc-rtags-wrapper.sh /somewhere/that/is/in/your/path/before/usr/bin/gcc
ln -s /path/to/rtags/bin/gcc-rtags-wrapper.sh /somewhere/that/is/in/your/path/before/usr/bin/c++
ln -s /path/to/rtags/bin/gcc-rtags-wrapper.sh /somewhere/that/is/in/your/path/before/usr/bin/cc
ln -s /path/to/rtags/bin/gcc-rtags-wrapper.sh /somewhere/that/is/in/your/path/before/usr/bin/g++
   #+END_SRC

   例如：

   #+BEGIN_SRC sh
which -a gcc | xargs file
/home/abakken/bin/gcc: symbolic link to `/home/abakken/dev/rtags/bin/gcc-rtags-wrapper.sh'
/usr/bin/gcc:         symbolic link to `gcc-4.7'
   #+END_SRC

   Now every time you compile a file with which gcc rc will get its grubby hands all over your command line and make sure RTags knows about it.

   现在每次使用 =which gcc= 编译文件，rc 都会处理你所有的命令行，以确保 RTage 知道。

   RTags will group source files into projects based on some heuristics.

   RTags 基于一些启发式会将工程中的源码文件分组。

   Essentially it will look for certain files/dirs (like configure/CMakeLists.txt/scons.1/.git) etc to try to determine the likely project root for each source file. For generated source files that end up in the build directory we try to find the source root based on similar heuristics around config.status/CMakeCache.txt etc. Usually this works out reasonably well. If it doesn’t for you, you can pass --project-root /path/to/the/project/root to rc.

   本质上它会查看特定文件/目录（比如 configure/CMakeLists.txt/scons.1/.git）等来尝试确定每个源码文件的可能的项目根目录。也会尝试根据源码在编译目录中生成的 config.status/CMakeCache.txt 等找到源码根目录。这通常可以很好的解决问题。如果不适合你，可以给 rc 传递 =--project-root /path/to/the/project/root= 。

   RTags only gives you information about current project when you ask for things by name. You can explicitly change the current project using:

   当通过名字查询时，Rtags 只会给出和当前工程有关的信息。使用如下命令可以显示改变当前工程：

   #+BEGIN_SRC sh
rc -w foobar
   #+END_SRC

   We try to do it automatically for you by passing along information about the current buffer when we call rc from elisp so that rdm can update its current project on demand.

   当从 elisp 调用 rc 时，将尝试自动传递当前 buffer 的信息，以便 rdm 可以根据需求自动更新它当前的项目，

   RTags keeps a cache of indexed data so you don’t have to reindex everything if you restart it.

   RTags 缓存了索引数据，因而重启后无需重建索引。

   The location of this data is by default ~/.rtags but can be overridden by passing --data-dir /other/dir to rdm or putting something like this in your ~/.rdmrc:

   数据的默认位置 =~/.rtags= ，但是通过给 rdm 传递 =--data-dir /other/dir= ，或者在 =~/.rdmrc= 中写入类似的内容进行覆盖，。

   #+BEGIN_EXAMPLE
   $ cat ~/.rdmrc
   --data-dir=/other/dir
   #+END_EXAMPLE
** Integration with systemd (GNU Linux)

   On GNU/Linux distributions based on the systemd service manager, rdm can also be socket acivated.

   基于 systemd 服务管理的 GNU/Linux 发行版中，rdm 可以通过 socket 激活。

   Add the following to ~/.config/systemd/user/rdm.socket

   将下面的代码写入 =~/.config/systemd/user/rdm.socket=

   #+BEGIN_EXAMPLE
   [Unit]
   Description=RTags daemon socket

   [Socket]
   ListenStream=%h/.rdm

   [Install]
   WantedBy=multi-user.target
   #+END_EXAMPLE

   Add the following to =~/.config/systemd/user/rdm.service=

   #+BEGIN_EXAMPLE
   [Unit]
   Description=RTags daemon

   Requires=rdm.socketp

   [Service]
   Type=simple
   ExecStart=$RDM -v --inactivity-timeout 300
   #+END_EXAMPLE


   Replace $RDM with the path to your copy of rdm, and add any command line parameters you might usually use.

   将 =$RDM= 替换为 =rdm= 的路径，添加可能使用的任何命令行参数。

   You have to use absolute paths here. %h is expanded to your home directory. Environment variables are not expanded inside strings.

   这里必须使用绝对路径。%h 将会扩展为 home 目录，字符串中的环境变量不会扩展。

   Run the following command from the terminal:

   从终端运行如下命令：

   #+BEGIN_SRC sh
 systemctl --user enable rdm.socket
 systemctl --user start rdm.socket
   #+END_SRC

   Systemd will create the rdm socket automatically.

   Systemd 将会自动创建 rdm 套接字。

   如果你更喜欢使用 SystemV，可以这样使用：

   #+BEGIN_SRC bash
#!/bin/bash
#
# chkconfig: 35 90 12
# description: Foo server
#

# Get function from functions library
. /etc/init.d/functions

# Start the service FOO
start() {
        initlog -c "echo -n Starting FOO server: "
        /path/to/FOO &
        ### Create the lock file ###
        touch /var/lock/subsys/FOO
        success $"FOO server startup"
        echo
}

# Restart the service FOO
stop() {
        initlog -c "echo -n Stopping FOO server: "
        killproc FOO
        ### Now, delete the lock file ###
        rm -f /var/lock/subsys/FOO
        echo
}

### main logic ###
case "$1" in
  start)
        start
        ;;
  stop)
        stop
        ;;
  status)
        status FOO
        ;;
  restart|reload|condrestart)
        stop
        start
        ;;
  *)
        echo $"Usage: $0 {start|stop|restart|reload|status}"
        exit 1
esac

exit 0
   #+END_SRC

