emacs/modes/rtags.html

<div id="outline-container-org128062a" class="outline-3">
<h3 id="org128062a"><span class="section-number-3">4.4</span> make</h3>
<div class="outline-text-3" id="text-4-4">
<p>
You can ask make to only print the recipes without actually doing something. This way may be perfectly fine for not too complex Makefiles.
</p>

<p>
可以让 make 只打印信息而不执行任何事情。这种方式可能对于不是很复杂的 makefile 有用。
</p>

<div class="org-src-container">
<pre class="src src-sh">make clean
make -nk | rc -c -
</pre>
</div>

<p>
There are very likely similar things you can do with other build systems that we’re unfamiliar with, please let us know if you do.
</p>

<p>
其他一些我们不熟悉的构建系统很可能做类似的事情，如果愿意的话，请告诉我们。
</p>

<p>
A different approach to get your files indexed is the man-in-the-middle
</p>

<p>
索引文件的另一种方法是中间人，可以这样做：
</p>

<div class="org-src-container">
<pre class="src src-sh">ln -s /path/to/rtags/bin/gcc-rtags-wrapper.sh /somewhere/that/is/in/your/path/before/usr/bin/gcc
ln -s /path/to/rtags/bin/gcc-rtags-wrapper.sh /somewhere/that/is/in/your/path/before/usr/bin/c++
ln -s /path/to/rtags/bin/gcc-rtags-wrapper.sh /somewhere/that/is/in/your/path/before/usr/bin/cc
ln -s /path/to/rtags/bin/gcc-rtags-wrapper.sh /somewhere/that/is/in/your/path/before/usr/bin/g++
</pre>
</div>

<p>
例如：
</p>

<div class="org-src-container">
<pre class="src src-sh">which -a gcc | xargs file
/home/abakken/bin/gcc: symbolic link to <span style="color: #fa8072;">`/home/abakken/dev/rtags/bin/gcc-rtags-wrapper.sh'</span>
<span style="color: #fa8072;">/usr/bin/gcc:         symbolic link to `</span>gcc-4.7<span style="color: #ff4ea3;">'</span>
</pre>
</div>

<p>
Now every time you compile a file with which gcc rc will get its grubby hands all over your command line and make sure RTags knows about it.
</p>

<p>
现在每次使用 <code>which gcc</code> 编译文件，rc 都会处理你所有的命令行，以确保 RTage 知道。
</p>

<p>
RTags will group source files into projects based on some heuristics.
</p>

<p>
RTags 基于一些启发式会将工程中的源码文件分组。
</p>

<p>
Essentially it will look for certain files/dirs (like configure/CMakeLists.txt/scons.1/.git) etc to try to determine the likely project root for each source file. For generated source files that end up in the build directory we try to find the source root based on similar heuristics around config.status/CMakeCache.txt etc. Usually this works out reasonably well. If it doesn’t for you, you can pass &#x2013;project-root /path/to/the/project/root to rc.
</p>

<p>
本质上它会查看特定文件/目录（比如 configure/CMakeLists.txt/scons.1/.git）等来尝试确定每个源码文件的可能的项目根目录。也会尝试根据源码在编译目录中生成的 config.status/CMakeCache.txt 等找到源码根目录。这通常可以很好的解决问题。如果不适合你，可以给 rc 传递 <code>--project-root /path/to/the/project/root</code> 。
</p>

<p>
RTags only gives you information about current project when you ask for things by name. You can explicitly change the current project using:
</p>

<p>
当通过名字查询时，Rtags 只会给出和当前工程有关的信息。使用如下命令可以显示改变当前工程：
</p>

<div class="org-src-container">
<pre class="src src-sh">rc -w foobar
</pre>
</div>

<p>
We try to do it automatically for you by passing along information about the current buffer when we call rc from elisp so that rdm can update its current project on demand.
</p>

<p>
当从 elisp 调用 rc 时，将尝试自动传递当前 buffer 的信息，以便 rdm 可以根据需求自动更新它当前的项目，
</p>

<p>
RTags keeps a cache of indexed data so you don’t have to reindex everything if you restart it.
</p>

<p>
RTags 缓存了索引数据，因而重启后无需重建索引。
</p>

<p>
The location of this data is by default ~/.rtags but can be overridden by passing &#x2013;data-dir <i>other/dir to rdm or putting something like this in your ~</i>.rdmrc:
</p>

<p>
数据的默认位置 <code>~/.rtags</code> ，但是通过给 rdm 传递 <code>--data-dir /other/dir</code> ，或者在 <code>~/.rdmrc</code> 中写入类似的内容进行覆盖，。
</p>

<pre class="example">
   $ cat ~/.rdmrc
   --data-dir=/other/dir
</pre>
</div>
</div>
<div id="outline-container-orgc2a90cc" class="outline-3">
<h3 id="orgc2a90cc"><span class="section-number-3">4.5</span> Integration with systemd (GNU Linux)</h3>
<div class="outline-text-3" id="text-4-5">
<p>
On GNU/Linux distributions based on the systemd service manager, rdm can also be socket acivated.
</p>

<p>
基于 systemd 服务管理的 GNU/Linux 发行版中，rdm 可以通过 socket 激活。
</p>

<p>
Add the following to ~/.config/systemd/user/rdm.socket
</p>

<p>
将下面的代码写入 <code>~/.config/systemd/user/rdm.socket</code>
</p>

<pre class="example">
   [Unit]
   Description=RTags daemon socket

   [Socket]
   ListenStream=%h/.rdm

   [Install]
   WantedBy=multi-user.target
</pre>

<p>
Add the following to <code>~/.config/systemd/user/rdm.service</code>
</p>

<pre class="example">
   [Unit]
   Description=RTags daemon

   Requires=rdm.socketp

   [Service]
   Type=simple
   ExecStart=$RDM -v --inactivity-timeout 300
</pre>


<p>
Replace $RDM with the path to your copy of rdm, and add any command line parameters you might usually use.
</p>

<p>
将 <code>$RDM</code> 替换为 <code>rdm</code> 的路径，添加可能使用的任何命令行参数。
</p>

<p>
You have to use absolute paths here. %h is expanded to your home directory. Environment variables are not expanded inside strings.
</p>

<p>
这里必须使用绝对路径。%h 将会扩展为 home 目录，字符串中的环境变量不会扩展。
</p>

<p>
Run the following command from the terminal:
</p>

<p>
从终端运行如下命令：
</p>

<div class="org-src-container">
<pre class="src src-sh"> systemctl --user enable rdm.socket
 systemctl --user start rdm.socket
</pre>
</div>

<p>
Systemd will create the rdm socket automatically.
</p>

<p>
Systemd 将会自动创建 rdm 套接字。
</p>

<p>
如果你更喜欢使用 SystemV，可以这样使用：
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #6c6c6c; font-style: italic;">#</span><span style="color: #6c6c6c; font-style: italic;">!/bin/</span><span style="color: #a1db00;">bash</span>
<span style="color: #6c6c6c; font-style: italic;">#</span>
<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">chkconfig: 35 90 12</span>
<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">description: Foo server</span>
<span style="color: #6c6c6c; font-style: italic;">#</span>

<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Get function from functions library</span>
<span style="color: #d18aff;">.</span> /etc/init.d/functions

<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Start the service FOO</span>
<span style="color: #ffd700;">start</span>() {
        initlog -c <span style="color: #ff4ea3;">"echo -n Starting FOO server: "</span>
        /path/to/FOO &amp;
        <span style="color: #6c6c6c; font-style: italic;">### </span><span style="color: #6c6c6c; font-style: italic;">Create the lock file ###</span>
        touch /var/lock/subsys/FOO
        success $<span style="color: #ff4ea3;">"FOO server startup"</span>
        <span style="color: #d18aff;">echo</span>
}

<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Restart the service FOO</span>
<span style="color: #ffd700;">stop</span>() {
        initlog -c <span style="color: #ff4ea3;">"echo -n Stopping FOO server: "</span>
        killproc FOO
        <span style="color: #6c6c6c; font-style: italic;">### </span><span style="color: #6c6c6c; font-style: italic;">Now, delete the lock file ###</span>
        rm -f /var/lock/subsys/FOO
        <span style="color: #d18aff;">echo</span>
}

<span style="color: #6c6c6c; font-style: italic;">### </span><span style="color: #6c6c6c; font-style: italic;">main logic ###</span>
<span style="color: #a1db00;">case</span> <span style="color: #ff4ea3;">"$1"</span><span style="color: #a1db00;"> in</span>
  start)
        start
        ;;
  stop)
        stop
        ;;
  status)
        status FOO
        ;;
  restart|reload|condrestart)
        stop
        start
        ;;
  *)
        <span style="color: #d18aff;">echo</span> $<span style="color: #ff4ea3;">"Usage: $0 {start|stop|restart|reload|status}"</span>
        <span style="color: #a1db00;">exit</span> 1
<span style="color: #a1db00;">esac</span>

<span style="color: #a1db00;">exit</span> 0
</pre>
</div>
</div>
</div>
</div>
