content/emacs/modes/rtags.org
* 使用

  Now that your files are indexed you can start using RTags. Normally you would do this from your editor but the way to extract this information from rdm is to use the command line tool rc.

  现在可以启动 RTags 索引文件了。通常希望从编辑器进行操作，但从 rdm 提取信息的方法是使用命令行工具 rc。 例如：

  #+BEGIN_SRC sh
$ rdm &
$ ninja -t commands | rc -c
$ rc --follow-location Job.cpp:20:10
/home/abakken/dev/rtags/src/Job.h:10:18      List<RegExp> *mPathFiltersRegExp;
  #+END_SRC

  A location has the format of file:line:column.

  location 格式是 ~file:line:column~ 。

  For Emacs we maintain a set of elisp bindings that allows you to control RTags from your editor. There are projects that provide integration for other editors out there.

  针对 Emacs 我们维护了一组 elisp 绑定，方便从编辑器控制 RTags。有些别的项目为其他编辑器提供了整合。

  Vim: https://github.com/lyuts/vim-rtags and https://github.com/shaneharper/vim-rtags

  Sublime Text: https://github.com/rampage644/sublime-rtags

  Atom: https://github.com/artagnon/atomic-rtags and https://github.com/rajendrant/atom-rtags

  rc has a vast number of commands and options and we intend to write a man page at some point. Most users will have limited interest in ever calling them manually and would rather just use the interactive elisp functions.

  rc 有大量的命令和选项，我们计划编写一个 man page。大多数用户对手动调用它们兴趣有限，他们更愿意使用交互的 elisp 函数。

* Elisp

