emacs/modes/rtags.html

<div id="outline-container-org527ba38" class="outline-2">
<h2 id="org527ba38"><span class="section-number-2">5</span> 使用</h2>
<div class="outline-text-2" id="text-5">
<p>
Now that your files are indexed you can start using RTags. Normally you would do this from your editor but the way to extract this information from rdm is to use the command line tool rc.
</p>

<p>
现在可以启动 RTags 索引文件了。通常希望从编辑器进行操作，但从 rdm 提取信息的方法是使用命令行工具 rc。 例如：
</p>

<div class="org-src-container">
<pre class="src src-sh">$ rdm &amp;
$ ninja -t commands | rc -c
$ rc --follow-location Job.cpp:20:10
/home/abakken/dev/rtags/src/Job.h:10:18      List&lt;RegExp&gt; *mPathFiltersRegExp;
</pre>
</div>

<p>
A location has the format of <a href="line:column">line:column</a>.
</p>

<p>
location 格式是 <code>file:line:column</code> 。
</p>

<p>
For Emacs we maintain a set of elisp bindings that allows you to control RTags from your editor. There are projects that provide integration for other editors out there.
</p>

<p>
针对 Emacs 我们维护了一组 elisp 绑定，方便从编辑器控制 RTags。有些别的项目为其他编辑器提供了整合。
</p>

<p>
Vim: <a href="https://github.com/lyuts/vim-rtags">https://github.com/lyuts/vim-rtags</a> and <a href="https://github.com/shaneharper/vim-rtags">https://github.com/shaneharper/vim-rtags</a>
</p>

<p>
Sublime Text: <a href="https://github.com/rampage644/sublime-rtags">https://github.com/rampage644/sublime-rtags</a>
</p>

<p>
Atom: <a href="https://github.com/artagnon/atomic-rtags">https://github.com/artagnon/atomic-rtags</a> and <a href="https://github.com/rajendrant/atom-rtags">https://github.com/rajendrant/atom-rtags</a>
</p>

<p>
rc has a vast number of commands and options and we intend to write a man page at some point. Most users will have limited interest in ever calling them manually and would rather just use the interactive elisp functions.
</p>

<p>
rc 有大量的命令和选项，我们计划编写一个 man page。大多数用户对手动调用它们兴趣有限，他们更愿意使用交互的 elisp 函数。
</p>
</div>
</div>
