content/emacs/modes/rtags.org
** Functions

   #+BEGIN_SRC elisp
(rtags-start-process-unless-running)
   #+END_SRC

   Start the rdm process unless the process is already running. You may create hook to automatically call this function upon entering, e.g. c-mode or c++mode.

   启动 rdm 进程，除非该进程已经运行。可以创建钩子函数在输入时自动调用该函数，例如 c-mode 或 c++-mode 中。例如：

   #+BEGIN_SRC elisp
(add-hook 'c-mode-hook 'rtags-start-process-unless-running)
(add-hook 'c++-mode-hook 'rtags-start-process-unless-running)
(add-hook 'objc-mode-hook 'rtags-start-process-unless-running)

   #+END_SRC

   #+BEGIN_SRC elisp
(rtags-restart-process)
   #+END_SRC

   Restart the rdm process.

   重启 rdm 进程。

   #+BEGIN_SRC emacs-lisp
 (rtags-find-symbol-at-point)
   #+END_SRC

   Follow symbol under cursor. For references this goes to the definition (or declaration if no definition is known of the symbol. For declarations it goes to the definition and vice versa. For definitions of variables/parameters with constructors it goes to the constructor in question. If you pass a prefix argument, limit to current source file, if you pass a prefix argument and have narrowed the current file, limit to the narrowed region. This prefix argument is the same for: rtags-find-references-at-point, rtags-find-symbol, rtags-find-references

   跟踪 cursor 下的符号。对于引用会跳转到定义（如果该符号没有定义则跳转到声明。对于声明跳转到定义。对于有构造函数的变量/参数的定义跳转到构造函数。如果传递前缀参数，限制在当前源码文件，如果传递前缀参数并 narrow 了当前文件，会限制于 narrowed 区域。前缀参数同样适用于 rtags-find-references-at-point, rtags-find-symbol, rtags-find-references）

   #+BEGIN_SRC emacs-lisp
 (rtags-find-references-at-point)
   #+END_SRC

   Find all references to symbol under cursor. If symbol is itself a reference it will find all references to the referenced symbol。

   查找当前 cursor 下符号的所有引用。如果符号本身是一个引用，将会查找该符号的所有引用。

   #+BEGIN_SRC emacs-lisp
(rtags-find-symbol)
   #+END_SRC

   Prompt for name of symbol to go to. Imagine the following code:

   提示想要跳转的符号，考虑下面的代码：

   #+BEGIN_SRC C++
       namespace N
       {
           class C
           {
           public:
               int func(int);
           };
       };

       using namespace N;
       int C::func(int val)
       {
           return val * 2;
       }
   #+END_SRC

   ~int N::C::func(int)~ will now be accessible by the following names:

   通过下面的代码可以访问到 ~int N::C::func(int)~ ：

   #+BEGIN_SRC C++
func
func(int)
C::func(int)
C::func
N::C::func(int)
N::C::func
   #+END_SRC

   #+BEGIN_SRC emacs-lisp
(rtags-find-references)
   #+END_SRC

   Prompt for name of symbol to find references to. Same as above but find references to symbol rather than declarations and definitions.

   提示要查找引用的符号。除了是查找引用而不是声明和定义，和上面没差别。

   #+BEGIN_SRC emacs-lisp
(rtags-diagnostics)
   #+END_SRC

   Start an async process in a buffer to receive warnings/errors from clang whenever a file gets reindexed. It integrates with flymake to put highlighting on code with warnings and errors。

   重新索引文件时，在 buffer 中启用异步进程接收来自 clang 的警告/错误。它和 flymake 整合在一起，高亮带有警告和错误的代码。

   #+BEGIN_SRC emacs-lisp
(rtags-enable-standard-keybindings)
   #+END_SRC

   Sets up a ton of standard keybindings under C-c r. If you pass a mode to the function it will set it up on that mode, otherwise it will use c-mode-base-map). You can choose a different prefix than C-c r like this:

   在 C-c r 下建立大量的标准键绑定。如果给该函数传递一个模式，将会设置在该模式下，否则使用 c-mode-base-map。可以这样选择不同于 =C-c r= 的前缀：

   #+BEGIN_SRC emacs-lisp
(rtags-enable-standard-keybindings c-mode-base-map "\C-xr")

   #+END_SRC

   #+BEGIN_SRC emacs-lisp
(rtags-find-file)
   #+END_SRC

   Lets you jump to file by name (partial or full, concept kinda stolen from gtags.el) with completion in the project. This includes all files under what we determine to be the root of the project, not just source files.

   在项目补全时通过名字（部分或全部，概念有点来自 gtags.el）跳转到文件。包括项目根目录下面的所有文件，不只是源码文件。

   #+BEGIN_SRC emacs-lisp
(rtags-find-virtuals-at-point)
   #+END_SRC

   For virtual functions, show the various reimplementations of the function at point。

   对于虚函数，显示当前 point 处函数的各种实现。

   #+BEGIN_SRC emacs-lisp
(rtags-fixit)
   #+END_SRC

   Apply clang’s automatic fixits in current file. If you pass a prefix arg use ediff to apply it. See (http://clang.llvm.org/diagnostics.html) for more info.

   在当前文件应用 clang 的自动修正。如果传递前缀参数，使用 ediff 来应用它。

   #+BEGIN_SRC emacs-lisp
(rtags-imenu)
   #+END_SRC

   Provides an ido-based imenu like interface to a subset of the symbols in the current file. Note that it does not actually use imenu infrastructure.

   为当前文件中的部分符号提供基于 ido 的类似 imenu 的接口。注意，它并不会使用 imenu 功能。

   #+BEGIN_SRC emacs-lisp
(rtags-location-stack-back)
(rtags-location-stack-forward)
   #+END_SRC

   Whenever RTags jumps somewhere it pushes a location onto its stack. Jump back and forward in this stack。

   RTags 跳转时都会将位置压栈。可以在栈中前后跳转。

   #+BEGIN_SRC emacs-lisp
(rtags-next-match)
(rtags-previous-match)
   #+END_SRC

   For functions that return more than one match, jump to the next/previous one.

   对于返回多个匹配的函数，跳转到下一个或下一个。

   #+BEGIN_SRC emacs-lisp
(rtags-preprocess-file)
   #+END_SRC

   Preprocess current file according to known C(XX)Flags and show the result in a buffer. If region is active only display the preprocessed output for that region.

   通过已知的 C(XX)标识预处理当前文件，在 buffer 中显示结果。如果激活了区域则只显示区域的处理结果。

   #+BEGIN_SRC emacs-lisp
(rtags-print-symbol-info)
   #+END_SRC

   Print some info about symbol under cursor

   打印 cursor 下符号的一些信息

   #+BEGIN_SRC emacs-lisp
(rtags-symbol-type)
   #+END_SRC

   Print the type of the symbol under cursor.

   打印 cursor 下符号的类型

   #+BEGIN_SRC emacs-lisp
(rtags-print-dependencies)
   #+END_SRC

   Open a buffer showing files that depend on current file/files that current file depends on.

   打开 buffer 显示当前文件所依赖的文件。

   #+BEGIN_SRC emacs-lisp
(rtags-print-enum-value-at-point)
   #+END_SRC

   Print integral value of enum value at point

   打印 point 处枚举变量的整数值。

   #+BEGIN_SRC emacs-lisp
(rtags-quit-rdm)
   #+END_SRC

   Shut down rdm

   关闭 rdm

   #+BEGIN_SRC emacs-lisp
(rtags-rename-symbol)
   #+END_SRC

   Rename symbol under cursor. Make sure all files are saved and fully indexed before using.

   重命名 cursor 下的符号。使用之前确保所有的文件已保存并全部被索引。

   #+BEGIN_SRC emacs-lisp
(rtags-reparse-file)
   #+END_SRC

   Explicitly trigger a reparse of current file. Mostly for debugging. Unless we have bugs it should not be necessary.

   显示触发重新解析当前文件。多用于调试。除非我们有不必要的 bug。

   #+BEGIN_SRC emacs-lisp
(rtags-show-rtags-buffer)
   #+END_SRC

   Switch to ~*RTags*~ buffer. This is the buffer where a number of functions display their alternatives when they have more than one match.

   切换到 ~*RTags*~ buffer。如果在该 buffer 中显示函数的多个匹配。

   #+BEGIN_SRC emacs-lisp
(rtags-include-file)

   #+END_SRC

   Insert selected or entered include, e.g. “string.h”/<string.h> in current buffer, either at the top, after the first include statement or with prefix argument (C-u) at current point.

   在当前 buffer 插入选中或输入的头文件，比如“string.h”/<string.h>，在顶部第一个头文件声明之后插入，使用前缀参数(C-u)在当前 point 处插入。

   #+BEGIN_SRC emacs-lisp
(rtags-get-include-file-for-symbol)
   #+END_SRC

   Insert include for entered symbol or symbol under courser in current buffer, either at the top, after the first include statement or with prefix argument (C-u) at current point.

   插入正在输入的符号或 cursor 下符号对应的头文件，在顶部第一个头文件声明之后插入，使用前缀参数(C-u)在当前 point 处插入。

