emacs/modes/rtags.html

<div id="outline-container-orgf7a383d" class="outline-2">
<h2 id="orgf7a383d"><span class="section-number-2">6</span> Elisp</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orgf0a74f2" class="outline-3">
<h3 id="orgf0a74f2"><span class="section-number-3">6.1</span> Functions</h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">
<pre class="src src-elisp">(rtags-start-process-unless-running)
</pre>
</div>

<p>
Start the rdm process unless the process is already running. You may create hook to automatically call this function upon entering, e.g. c-mode or c++mode.
</p>

<p>
启动 rdm 进程，除非该进程已经运行。可以创建钩子函数在输入时自动调用该函数，例如 c-mode 或 c++-mode 中。例如：
</p>

<div class="org-src-container">
<pre class="src src-elisp">(add-hook 'c-mode-hook 'rtags-start-process-unless-running)
(add-hook 'c++-mode-hook 'rtags-start-process-unless-running)
(add-hook 'objc-mode-hook 'rtags-start-process-unless-running)

</pre>
</div>

<div class="org-src-container">
<pre class="src src-elisp">(rtags-restart-process)
</pre>
</div>

<p>
Restart the rdm process.
</p>

<p>
重启 rdm 进程。
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"> (rtags-find-symbol-at-point)
</pre>
</div>

<p>
Follow symbol under cursor. For references this goes to the definition (or declaration if no definition is known of the symbol. For declarations it goes to the definition and vice versa. For definitions of variables/parameters with constructors it goes to the constructor in question. If you pass a prefix argument, limit to current source file, if you pass a prefix argument and have narrowed the current file, limit to the narrowed region. This prefix argument is the same for: rtags-find-references-at-point, rtags-find-symbol, rtags-find-references
</p>

<p>
跟踪 cursor 下的符号。对于引用会跳转到定义（如果该符号没有定义则跳转到声明。对于声明跳转到定义。对于有构造函数的变量/参数的定义跳转到构造函数。如果传递前缀参数，限制在当前源码文件，如果传递前缀参数并 narrow 了当前文件，会限制于 narrowed 区域。前缀参数同样适用于 rtags-find-references-at-point, rtags-find-symbol, rtags-find-references）
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"> (rtags-find-references-at-point)
</pre>
</div>

<p>
Find all references to symbol under cursor. If symbol is itself a reference it will find all references to the referenced symbol。
</p>

<p>
查找当前 cursor 下符号的所有引用。如果符号本身是一个引用，将会查找该符号的所有引用。
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(rtags-find-symbol)
</pre>
</div>

<p>
Prompt for name of symbol to go to. Imagine the following code:
</p>

<p>
提示想要跳转的符号，考虑下面的代码：
</p>

<div class="org-src-container">
<pre class="src src-C++">       <span style="color: #a1db00;">namespace</span> <span style="color: #5fafd7;">N</span>
       {
           <span style="color: #a1db00;">class</span> <span style="color: #00d7af;">C</span>
           {
           <span style="color: #a1db00;">public</span>:
               <span style="color: #00d7af;">int</span> <span style="color: #ffd700;">func</span>(<span style="color: #00d7af;">int</span>);
           };
       };

       <span style="color: #a1db00;">using</span> <span style="color: #a1db00;">namespace</span> <span style="color: #5fafd7;">N</span>;
       <span style="color: #00d7af;">int</span> <span style="color: #5fafd7;">C</span>::<span style="color: #ffd700;">func</span>(<span style="color: #00d7af;">int</span> <span style="color: #ff8700;">val</span>)
       {
           <span style="color: #a1db00;">return</span> val * 2;
       }
</pre>
</div>

<p>
<code>int N::C::func(int)</code> will now be accessible by the following names:
</p>

<p>
通过下面的代码可以访问到 <code>int N::C::func(int)</code> ：
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #00d7af;">func</span>
<span style="color: #ffd700;">func</span>(<span style="color: #00d7af;">int</span>)
<span style="color: #5fafd7;">C</span>::func(<span style="color: #00d7af;">int</span>)
<span style="color: #5fafd7;">C</span>::<span style="color: #00d7af;">func</span>
<span style="color: #5fafd7;">N</span>::<span style="color: #5fafd7;">C</span>::<span style="color: #ffd700;">func</span>(<span style="color: #00d7af;">int</span>)
<span style="color: #5fafd7;">N</span>::<span style="color: #5fafd7;">C</span>::func
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(rtags-find-references)
</pre>
</div>

<p>
Prompt for name of symbol to find references to. Same as above but find references to symbol rather than declarations and definitions.
</p>

<p>
提示要查找引用的符号。除了是查找引用而不是声明和定义，和上面没差别。
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(rtags-diagnostics)
</pre>
</div>

<p>
Start an async process in a buffer to receive warnings/errors from clang whenever a file gets reindexed. It integrates with flymake to put highlighting on code with warnings and errors。
</p>

<p>
重新索引文件时，在 buffer 中启用异步进程接收来自 clang 的警告/错误。它和 flymake 整合在一起，高亮带有警告和错误的代码。
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(rtags-enable-standard-keybindings)
</pre>
</div>

<p>
Sets up a ton of standard keybindings under C-c r. If you pass a mode to the function it will set it up on that mode, otherwise it will use c-mode-base-map). You can choose a different prefix than C-c r like this:
</p>

<p>
在 C-c r 下建立大量的标准键绑定。如果给该函数传递一个模式，将会设置在该模式下，否则使用 c-mode-base-map。可以这样选择不同于 <code>C-c r</code> 的前缀：
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(rtags-enable-standard-keybindings c-mode-base-map <span style="color: #ff4ea3;">"\C-xr"</span>)

</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(rtags-find-file)
</pre>
</div>

<p>
Lets you jump to file by name (partial or full, concept kinda stolen from gtags.el) with completion in the project. This includes all files under what we determine to be the root of the project, not just source files.
</p>

<p>
在项目补全时通过名字（部分或全部，概念有点来自 gtags.el）跳转到文件。包括项目根目录下面的所有文件，不只是源码文件。
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(rtags-find-virtuals-at-point)
</pre>
</div>

<p>
For virtual functions, show the various reimplementations of the function at point。
</p>

<p>
对于虚函数，显示当前 point 处函数的各种实现。
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(rtags-fixit)
</pre>
</div>

<p>
Apply clang’s automatic fixits in current file. If you pass a prefix arg use ediff to apply it. See (<a href="http://clang.llvm.org/diagnostics.html">http://clang.llvm.org/diagnostics.html</a>) for more info.
</p>

<p>
在当前文件应用 clang 的自动修正。如果传递前缀参数，使用 ediff 来应用它。
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(rtags-imenu)
</pre>
</div>

<p>
Provides an ido-based imenu like interface to a subset of the symbols in the current file. Note that it does not actually use imenu infrastructure.
</p>

<p>
为当前文件中的部分符号提供基于 ido 的类似 imenu 的接口。注意，它并不会使用 imenu 功能。
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(rtags-location-stack-back)
(rtags-location-stack-forward)
</pre>
</div>

<p>
Whenever RTags jumps somewhere it pushes a location onto its stack. Jump back and forward in this stack。
</p>

<p>
RTags 跳转时都会将位置压栈。可以在栈中前后跳转。
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(rtags-next-match)
(rtags-previous-match)
</pre>
</div>

<p>
For functions that return more than one match, jump to the next/previous one.
</p>

<p>
对于返回多个匹配的函数，跳转到下一个或下一个。
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(rtags-preprocess-file)
</pre>
</div>

<p>
Preprocess current file according to known C(XX)Flags and show the result in a buffer. If region is active only display the preprocessed output for that region.
</p>

<p>
通过已知的 C(XX)标识预处理当前文件，在 buffer 中显示结果。如果激活了区域则只显示区域的处理结果。
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(rtags-print-symbol-info)
</pre>
</div>

<p>
Print some info about symbol under cursor
</p>

<p>
打印 cursor 下符号的一些信息
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(rtags-symbol-type)
</pre>
</div>

<p>
Print the type of the symbol under cursor.
</p>

<p>
打印 cursor 下符号的类型
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(rtags-print-dependencies)
</pre>
</div>

<p>
Open a buffer showing files that depend on current file/files that current file depends on.
</p>

<p>
打开 buffer 显示当前文件所依赖的文件。
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(rtags-print-enum-value-at-point)
</pre>
</div>

<p>
Print integral value of enum value at point
</p>

<p>
打印 point 处枚举变量的整数值。
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(rtags-quit-rdm)
</pre>
</div>

<p>
Shut down rdm
</p>

<p>
关闭 rdm
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(rtags-rename-symbol)
</pre>
</div>

<p>
Rename symbol under cursor. Make sure all files are saved and fully indexed before using.
</p>

<p>
重命名 cursor 下的符号。使用之前确保所有的文件已保存并全部被索引。
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(rtags-reparse-file)
</pre>
</div>

<p>
Explicitly trigger a reparse of current file. Mostly for debugging. Unless we have bugs it should not be necessary.
</p>

<p>
显示触发重新解析当前文件。多用于调试。除非我们有不必要的 bug。
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(rtags-show-rtags-buffer)
</pre>
</div>

<p>
Switch to <code>*RTags*</code> buffer. This is the buffer where a number of functions display their alternatives when they have more than one match.
</p>

<p>
切换到 <code>*RTags*</code> buffer。如果在该 buffer 中显示函数的多个匹配。
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(rtags-include-file)

</pre>
</div>

<p>
Insert selected or entered include, e.g. “string.h”/&lt;string.h&gt; in current buffer, either at the top, after the first include statement or with prefix argument (C-u) at current point.
</p>

<p>
在当前 buffer 插入选中或输入的头文件，比如“string.h”/&lt;string.h&gt;，在顶部第一个头文件声明之后插入，使用前缀参数(C-u)在当前 point 处插入。
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(rtags-get-include-file-for-symbol)
</pre>
</div>

<p>
Insert include for entered symbol or symbol under courser in current buffer, either at the top, after the first include statement or with prefix argument (C-u) at current point.
</p>

<p>
插入正在输入的符号或 cursor 下符号对应的头文件，在顶部第一个头文件声明之后插入，使用前缀参数(C-u)在当前 point 处插入。
</p>
</div>
</div>
</div>
