content/emacs/modes/rtags.org
* Variables

** rtags-path
   Path to rc/rdm if they’re not in $PATH.

   如果 =rc/rdm= 不在 =$PATH= 中，改变量说明它们的路径。

** rtags-jump-to-first-match
   Similar to compilation-auto-jump-to-first-error. Whether to jump to the first match automatically when there’s more than one.

   类似 compilation-auto-jump-to-first-error。当有多个匹配时，是否自动跳转到第一个匹配。

** rtags-find-file-case-insensitive
   Whether to match files case-insensitively

   匹配文件是否区分大小写。

** rtags-find-file-prefer-exact-match
   Whether to exclude partial matches for file names when an exact match is found. E.g. /foobar.cpp /bar.cpp If rtags-find-file-prefer-exact-match is t a query for bar.cpp would only return /bar.cpp, otherwise both foobar.cpp and bar.cpp would be returned.

   是否在找到完全匹配时排除文件名的部分匹配。 例如。 /foobar.cpp /bar.cpp 如果 rtags-find-file-prefer-exact-match 是 t，查询 bar.cpp，则只会返回 / bar.cpp，否则将返回 foobar.cpp 和 bar.cpp。

* Fall back to other taggers（回退到其他 tagger）

  You can do something like the following to fall back to e.g. gtags if RTags doesn’t have a certain project indexed:

  如果 RTags 不能索引特定项目，可以使用下面的代码回退，比如 gtags。

  #+BEGIN_SRC emacs-lisp
(defun use-rtags (&optional useFileManager)
  (and (rtags-executable-find "rc")
       (cond ((not (gtags-get-rootpath)) t)
             ((and (not (eq major-mode 'c++-mode))
                   (not (eq major-mode 'c-mode))) (rtags-has-filemanager))
             (useFileManager (rtags-has-filemanager))
             (t (rtags-is-indexed)))))

(defun tags-find-symbol-at-point (&optional prefix)
  (interactive "P")
  (if (and (not (rtags-find-symbol-at-point prefix)) rtags-last-request-not-indexed)
      (gtags-find-tag)))
(defun tags-find-references-at-point (&optional prefix)
  (interactive "P")
  (if (and (not (rtags-find-references-at-point prefix)) rtags-last-request-not-indexed)
      (gtags-find-rtag)))
(defun tags-find-symbol ()
  (interactive)
  (call-interactively (if (use-rtags) 'rtags-find-symbol 'gtags-find-symbol)))
(defun tags-find-references ()
  (interactive)
  (call-interactively (if (use-rtags) 'rtags-find-references 'gtags-find-rtag)))
(defun tags-find-file ()
  (interactive)
  (call-interactively (if (use-rtags t) 'rtags-find-file 'gtags-find-file)))
(defun tags-imenu ()
  (interactive)
  (call-interactively (if (use-rtags t) 'rtags-imenu 'idomenu)))

(define-key c-mode-base-map (kbd "M-.") (function tags-find-symbol-at-point))
(define-key c-mode-base-map (kbd "M-,") (function tags-find-references-at-point))
(define-key c-mode-base-map (kbd "M-;") (function tags-find-file))
(define-key c-mode-base-map (kbd "C-.") (function tags-find-symbol))
(define-key c-mode-base-map (kbd "C-,") (function tags-find-references))
(define-key c-mode-base-map (kbd "C-<") (function rtags-find-virtuals-at-point))
(define-key c-mode-base-map (kbd "M-i") (function tags-imenu))

(define-key global-map (kbd "M-.") (function tags-find-symbol-at-point))
(define-key global-map (kbd "M-,") (function tags-find-references-at-point))
(define-key global-map (kbd "M-;") (function tags-find-file))
(define-key global-map (kbd "C-.") (function tags-find-symbol))
(define-key global-map (kbd "C-,") (function tags-find-references))
(define-key global-map (kbd "C-<") (function rtags-find-virtuals-at-point))
(define-key global-map (kbd "M-i") (function tags-imenu))
  #+END_SRC

* Code Completion in Emacs:（代码补全）

  To enable code completion in Emacs with company mode do the following:

  Emacs 中结合 company mode 启用代码补全：

  + Enable rtags-diagnostics. The easiest way is to:

    启用 rtags-diagnostics，最简单的方式如下：

    #+BEGIN_SRC emacs-lisp
(setq rtags-autostart-diagnostics t)
    #+END_SRC

  + but you can also explicitly start it with

    也可以显示启动：

    #+BEGIN_EXAMPLE
    M-x rtags-diagnostics <RET>
    #+END_EXAMPLE

  + Enable completions in RTags:

    使用 RTags 补全：

    #+BEGIN_SRC emacs-lisp
(setq rtags-completions-enabled t)
    #+END_SRC

  + Enable company-mode

    启用 company-mode

    #+BEGIN_SRC emacs-lisp
(require 'company)
(global-company-mode)
    #+END_SRC

  + Add company-rtags to company-backends:

    company-rtags 添加到 company-backends:

    #+BEGIN_SRC emacs-lisp
(push 'company-rtags company-backends)
    #+END_SRC

    This minimal init.el configuration should be enough to get completion to work.

    最小的 init.el 应该足以完成启用补全。
    #+BEGIN_SRC emacs-lisp
(require 'package)
(package-initialize)
(require 'rtags)
(require 'company)

(setq rtags-autostart-diagnostics t)
(rtags-diagnostics)
(setq rtags-completions-enabled t)
(push 'company-rtags company-backends)
(global-company-mode)
(define-key c-mode-base-map (kbd "<C-tab>") (function company-complete))
    #+END_SRC

    To enable completion in Emacs with auto-complete-mode do the following: …TODO…

    Emacs 中配合 auto-complete-mode 启用补全。。还未实现。。。

* RTags Flycheck integration

  To turn on RTags Flycheck support you need to load the flycheck-rtags package.

  RTags Flycheck 需要加载 flycheck-rtags package.

  #+BEGIN_SRC emacs-lisp
(require 'flycheck-rtags)
  #+END_SRC

