emacs/modes/rtags.html

<div id="outline-container-org24e751e" class="outline-2">
<h2 id="org24e751e"><span class="section-number-2">7</span> Variables</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orgcf407cc" class="outline-3">
<h3 id="orgcf407cc"><span class="section-number-3">7.1</span> rtags-path</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Path to rc/rdm if they’re not in $PATH.
</p>

<p>
如果 <code>rc/rdm</code> 不在 <code>$PATH</code> 中，改变量说明它们的路径。
</p>
</div>
</div>

<div id="outline-container-org911577c" class="outline-3">
<h3 id="org911577c"><span class="section-number-3">7.2</span> rtags-jump-to-first-match</h3>
<div class="outline-text-3" id="text-7-2">
<p>
Similar to compilation-auto-jump-to-first-error. Whether to jump to the first match automatically when there’s more than one.
</p>

<p>
类似 compilation-auto-jump-to-first-error。当有多个匹配时，是否自动跳转到第一个匹配。
</p>
</div>
</div>

<div id="outline-container-orgf1ce764" class="outline-3">
<h3 id="orgf1ce764"><span class="section-number-3">7.3</span> rtags-find-file-case-insensitive</h3>
<div class="outline-text-3" id="text-7-3">
<p>
Whether to match files case-insensitively
</p>

<p>
匹配文件是否区分大小写。
</p>
</div>
</div>

<div id="outline-container-org7dd9748" class="outline-3">
<h3 id="org7dd9748"><span class="section-number-3">7.4</span> rtags-find-file-prefer-exact-match</h3>
<div class="outline-text-3" id="text-7-4">
<p>
Whether to exclude partial matches for file names when an exact match is found. E.g. /foobar.cpp /bar.cpp If rtags-find-file-prefer-exact-match is t a query for bar.cpp would only return /bar.cpp, otherwise both foobar.cpp and bar.cpp would be returned.
</p>

<p>
是否在找到完全匹配时排除文件名的部分匹配。 例如。 /foobar.cpp /bar.cpp 如果 rtags-find-file-prefer-exact-match 是 t，查询 bar.cpp，则只会返回 / bar.cpp，否则将返回 foobar.cpp 和 bar.cpp。
</p>
</div>
</div>
</div>

<div id="outline-container-org93f018b" class="outline-2">
<h2 id="org93f018b"><span class="section-number-2">8</span> Fall back to other taggers（回退到其他 tagger）</h2>
<div class="outline-text-2" id="text-8">
<p>
You can do something like the following to fall back to e.g. gtags if RTags doesn’t have a certain project indexed:
</p>

<p>
如果 RTags 不能索引特定项目，可以使用下面的代码回退，比如 gtags。
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a1db00;">defun</span> <span style="color: #ffd700;">use-rtags</span> (<span style="color: #00d7af;">&amp;optional</span> useFileManager)
  (<span style="color: #a1db00;">and</span> (rtags-executable-find <span style="color: #ff4ea3;">"rc"</span>)
       (<span style="color: #a1db00;">cond</span> ((not (gtags-get-rootpath)) t)
             ((<span style="color: #a1db00;">and</span> (not (eq major-mode 'c++-mode))
                   (not (eq major-mode 'c-mode))) <span style="color: #dd0000; font-weight: bold;">(rtags-has-filemanager))</span>
             (useFileManager (rtags-has-filemanager))
             (t (rtags-is-indexed)))))

(<span style="color: #a1db00;">defun</span> <span style="color: #ffd700;">tags-find-symbol-at-point</span> (<span style="color: #00d7af;">&amp;optional</span> prefix)
  (<span style="color: #a1db00;">interactive</span> <span style="color: #ff4ea3;">"P"</span>)
  (<span style="color: #a1db00;">if</span> (<span style="color: #a1db00;">and</span> (not (rtags-find-symbol-at-point prefix)) rtags-last-request-not-indexed)
      (gtags-find-tag)))
(<span style="color: #a1db00;">defun</span> <span style="color: #ffd700;">tags-find-references-at-point</span> (<span style="color: #00d7af;">&amp;optional</span> prefix)
  (<span style="color: #a1db00;">interactive</span> <span style="color: #ff4ea3;">"P"</span>)
  (<span style="color: #a1db00;">if</span> (<span style="color: #a1db00;">and</span> (not (rtags-find-references-at-point prefix)) rtags-last-request-not-indexed)
      (gtags-find-rtag)))
(<span style="color: #a1db00;">defun</span> <span style="color: #ffd700;">tags-find-symbol</span> ()
  (<span style="color: #a1db00;">interactive</span>)
  (call-interactively (<span style="color: #a1db00;">if</span> (use-rtags) 'rtags-find-symbol 'gtags-find-symbol)))
(<span style="color: #a1db00;">defun</span> <span style="color: #ffd700;">tags-find-references</span> ()
  (<span style="color: #a1db00;">interactive</span>)
  (call-interactively (<span style="color: #a1db00;">if</span> (use-rtags) 'rtags-find-references 'gtags-find-rtag)))
(<span style="color: #a1db00;">defun</span> <span style="color: #ffd700;">tags-find-file</span> ()
  (<span style="color: #a1db00;">interactive</span>)
  (call-interactively (<span style="color: #a1db00;">if</span> (use-rtags t) 'rtags-find-file 'gtags-find-file)))
(<span style="color: #a1db00;">defun</span> <span style="color: #ffd700;">tags-imenu</span> ()
  (<span style="color: #a1db00;">interactive</span>)
  (call-interactively (<span style="color: #a1db00;">if</span> (use-rtags t) 'rtags-imenu 'idomenu)))

(define-key c-mode-base-map (kbd <span style="color: #ff4ea3;">"M-."</span>) (<span style="color: #a1db00;">function</span> tags-find-symbol-at-point))
(define-key c-mode-base-map (kbd <span style="color: #ff4ea3;">"M-,"</span>) (<span style="color: #a1db00;">function</span> tags-find-references-at-point))
(define-key c-mode-base-map (kbd <span style="color: #ff4ea3;">"M-;"</span>) (<span style="color: #a1db00;">function</span> tags-find-file))
(define-key c-mode-base-map (kbd <span style="color: #ff4ea3;">"C-."</span>) (<span style="color: #a1db00;">function</span> tags-find-symbol))
(define-key c-mode-base-map (kbd <span style="color: #ff4ea3;">"C-,"</span>) (<span style="color: #a1db00;">function</span> tags-find-references))
(define-key c-mode-base-map (kbd <span style="color: #ff4ea3;">"C-&lt;"</span>) (<span style="color: #a1db00;">function</span> rtags-find-virtuals-at-point))
(define-key c-mode-base-map (kbd <span style="color: #ff4ea3;">"M-i"</span>) (<span style="color: #a1db00;">function</span> tags-imenu))

(define-key global-map (kbd <span style="color: #ff4ea3;">"M-."</span>) (<span style="color: #a1db00;">function</span> tags-find-symbol-at-point))
(define-key global-map (kbd <span style="color: #ff4ea3;">"M-,"</span>) (<span style="color: #a1db00;">function</span> tags-find-references-at-point))
(define-key global-map (kbd <span style="color: #ff4ea3;">"M-;"</span>) (<span style="color: #a1db00;">function</span> tags-find-file))
(define-key global-map (kbd <span style="color: #ff4ea3;">"C-."</span>) (<span style="color: #a1db00;">function</span> tags-find-symbol))
(define-key global-map (kbd <span style="color: #ff4ea3;">"C-,"</span>) (<span style="color: #a1db00;">function</span> tags-find-references))
(define-key global-map (kbd <span style="color: #ff4ea3;">"C-&lt;"</span>) (<span style="color: #a1db00;">function</span> rtags-find-virtuals-at-point))
(define-key global-map (kbd <span style="color: #ff4ea3;">"M-i"</span>) (<span style="color: #a1db00;">function</span> tags-imenu))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfee93d2" class="outline-2">
<h2 id="orgfee93d2"><span class="section-number-2">9</span> Code Completion in Emacs:（代码补全）</h2>
<div class="outline-text-2" id="text-9">
<p>
To enable code completion in Emacs with company mode do the following:
</p>

<p>
Emacs 中结合 company mode 启用代码补全：
</p>

<ul class="org-ul">
<li><p>
Enable rtags-diagnostics. The easiest way is to:
</p>

<p>
启用 rtags-diagnostics，最简单的方式如下：
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a1db00;">setq</span> rtags-autostart-diagnostics t)
</pre>
</div></li>

<li><p>
but you can also explicitly start it with
</p>

<p>
也可以显示启动：
</p>

<pre class="example">
    M-x rtags-diagnostics &lt;RET&gt;
</pre></li>

<li><p>
Enable completions in RTags:
</p>

<p>
使用 RTags 补全：
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a1db00;">setq</span> rtags-completions-enabled t)
</pre>
</div></li>

<li><p>
Enable company-mode
</p>

<p>
启用 company-mode
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a1db00;">require</span> '<span style="color: #5fafd7;">company</span>)
(global-company-mode)
</pre>
</div></li>

<li><p>
Add company-rtags to company-backends:
</p>

<p>
company-rtags 添加到 company-backends:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a1db00;">push</span> 'company-rtags company-backends)
</pre>
</div>

<p>
This minimal init.el configuration should be enough to get completion to work.
</p>

<p>
最小的 init.el 应该足以完成启用补全。
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a1db00;">require</span> '<span style="color: #5fafd7;">package</span>)
(package-initialize)
(<span style="color: #a1db00;">require</span> '<span style="color: #5fafd7;">rtags</span>)
(<span style="color: #a1db00;">require</span> '<span style="color: #5fafd7;">company</span>)

(<span style="color: #a1db00;">setq</span> rtags-autostart-diagnostics t)
(rtags-diagnostics)
(<span style="color: #a1db00;">setq</span> rtags-completions-enabled t)
(<span style="color: #a1db00;">push</span> 'company-rtags company-backends)
(global-company-mode)
(define-key c-mode-base-map (kbd <span style="color: #ff4ea3;">"&lt;C-tab&gt;"</span>) (<span style="color: #a1db00;">function</span> company-complete))
</pre>
</div>

<p>
To enable completion in Emacs with auto-complete-mode do the following: …TODO…
</p>

<p>
Emacs 中配合 auto-complete-mode 启用补全。。还未实现。。。
</p></li>
</ul>
</div>
</div>

<div id="outline-container-orge2e9d87" class="outline-2">
<h2 id="orge2e9d87"><span class="section-number-2">10</span> RTags Flycheck integration</h2>
<div class="outline-text-2" id="text-10">
<p>
To turn on RTags Flycheck support you need to load the flycheck-rtags package.
</p>

<p>
RTags Flycheck 需要加载 flycheck-rtags package.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a1db00;">require</span> '<span style="color: #5fafd7;">flycheck-rtags</span>)
</pre>
</div>
</div>
