content/emacs/modes/rtags.org
** Optional

   You may explicitly select the RTags Flycheck checker for some major modes for better experience.

   可以为某些 major mode 显式选择 RTags Flycheck 检查以获得的更好体验。

   At the moment there is no customize option available to choose between rtags-diagnostics overlays or Flycheck overlays, nor is it planned right now. We recommend setting flycheck-highlighting-mode locally to nil as the RTags overlays are more accurate.

   目前没有可用的定制选项选择 rtags-diagnostics overlays or Flycheck overlays，现在也不计划这么做。推荐局部设置 flycheck-highlighting-mode 为 nil，因为 RTags overlays 更准确。

   Further, Flycheck will trigger automatically, based on events, the syntax checker for the current buffer, this is however, pretty useless in conjunction with RTags. We trigger it manually because we find it gives you a better experience. To turn off the automatic Flycheck syntax checking, set the variable flycheck-check-syntax-automatically locally to nil.

   此外，Flycheck 将根据事件自动激活针对当前 buffer 的语法检查器，然而这与 RTags 结合在一起显得相当无用。手动激活它将会有更好的体验。将 flycheck-check-syntax-automatically 局部设置为 nil 关闭 Flycheck 自动语法检查。

   #+BEGIN_SRC emacs-lisp
(defun my-flycheck-rtags-setup ()
  (flycheck-select-checker 'rtags)
  (setq-local flycheck-highlighting-mode nil) ;; RTags creates more accurate overlays.
  (setq-local flycheck-check-syntax-automatically nil))
;; c-mode-common-hook is also called by c++-mode
(add-hook 'c-mode-common-hook #'my-flycheck-rtags-setup)
   #+END_SRC

* Debugging RTags（调试 RTags）

  If you find that rp is crashing (leading to output like this: “job crashed 191 9698036154370 0x331e7e30”). You should be able to do the following:

  如果发现 rp 崩溃了（出现类似的输出“job crashed 191 9698036154370 0x331e7e30”）。应该如下处理：

  #+BEGIN_SRC sh
rdm --suspend-rp-on-crash
  #+END_SRC


  When rp crashes the rp process will stay alive, enabling you to debug it with something like this:

  当 rp 崩溃，rp 继承仍然存活，可以如下调试：

  #+BEGIN_SRC sh
gdb -p `pidof rp`
  #+END_SRC

* Support for other editors（支持其他编辑器）

  There are several other projects integrating RTags with other editors.

  有一些其他的项目将 RTags 与其他编辑器整合。

  Sublime Text: https://github.com/rampage644/sublime-rtags

  Vim: https://github.com/lyuts/vim-rtags https://github.com/shaneharper/vim-rtags https://github.com/mattn/vim-rtags

  Note to those maintainers. If you need RTags to behave differently or add features to make these other integration’s easier (like produce output in other formats etc), just drop us a note.

  这些维护者请注意，如果需要 RTags 有所不同或添加功能让这些其他集成更简单（比如产生其他格式输出），请给我们留言。

* Disclaimer（免责声明）

  RTags is still under development and is not the most stable piece of software you’ll ever find. We’re constantly working to improve on it.

  RTags 仍处于开发阶段，你会发现它并不是最稳定的软件。我们正为了改进它坚持不懈的工作。
