emacs/modes/rtags.html

<div id="outline-container-org1df1fac" class="outline-3">
<h3 id="org1df1fac"><span class="section-number-3">10.1</span> Optional</h3>
<div class="outline-text-3" id="text-10-1">
<p>
You may explicitly select the RTags Flycheck checker for some major modes for better experience.
</p>

<p>
可以为某些 major mode 显式选择 RTags Flycheck 检查以获得的更好体验。
</p>

<p>
At the moment there is no customize option available to choose between rtags-diagnostics overlays or Flycheck overlays, nor is it planned right now. We recommend setting flycheck-highlighting-mode locally to nil as the RTags overlays are more accurate.
</p>

<p>
目前没有可用的定制选项选择 rtags-diagnostics overlays or Flycheck overlays，现在也不计划这么做。推荐局部设置 flycheck-highlighting-mode 为 nil，因为 RTags overlays 更准确。
</p>

<p>
Further, Flycheck will trigger automatically, based on events, the syntax checker for the current buffer, this is however, pretty useless in conjunction with RTags. We trigger it manually because we find it gives you a better experience. To turn off the automatic Flycheck syntax checking, set the variable flycheck-check-syntax-automatically locally to nil.
</p>

<p>
此外，Flycheck 将根据事件自动激活针对当前 buffer 的语法检查器，然而这与 RTags 结合在一起显得相当无用。手动激活它将会有更好的体验。将 flycheck-check-syntax-automatically 局部设置为 nil 关闭 Flycheck 自动语法检查。
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a1db00;">defun</span> <span style="color: #ffd700;">my-flycheck-rtags-setup</span> ()
  (flycheck-select-checker 'rtags)
  (<span style="color: #a1db00;">setq-local</span> flycheck-highlighting-mode nil) <span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">RTags creates more accurate overlays.</span>
  (<span style="color: #a1db00;">setq-local</span> flycheck-check-syntax-automatically nil))
<span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">c-mode-common-hook is also called by c++-mode</span>
(add-hook 'c-mode-common-hook #'my-flycheck-rtags-setup)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org791390d" class="outline-2">
<h2 id="org791390d"><span class="section-number-2">11</span> Debugging RTags（调试 RTags）</h2>
<div class="outline-text-2" id="text-11">
<p>
If you find that rp is crashing (leading to output like this: “job crashed 191 9698036154370 0x331e7e30”). You should be able to do the following:
</p>

<p>
如果发现 rp 崩溃了（出现类似的输出“job crashed 191 9698036154370 0x331e7e30”）。应该如下处理：
</p>

<div class="org-src-container">
<pre class="src src-sh">rdm --suspend-rp-on-crash
</pre>
</div>


<p>
When rp crashes the rp process will stay alive, enabling you to debug it with something like this:
</p>

<p>
当 rp 崩溃，rp 继承仍然存活，可以如下调试：
</p>

<div class="org-src-container">
<pre class="src src-sh">gdb -p <span style="color: #fa8072;">`pidof rp`</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf3e85b9" class="outline-2">
<h2 id="orgf3e85b9"><span class="section-number-2">12</span> Support for other editors（支持其他编辑器）</h2>
<div class="outline-text-2" id="text-12">
<p>
There are several other projects integrating RTags with other editors.
</p>

<p>
有一些其他的项目将 RTags 与其他编辑器整合。
</p>

<p>
Sublime Text: <a href="https://github.com/rampage644/sublime-rtags">https://github.com/rampage644/sublime-rtags</a>
</p>

<p>
Vim: <a href="https://github.com/lyuts/vim-rtags">https://github.com/lyuts/vim-rtags</a> <a href="https://github.com/shaneharper/vim-rtags">https://github.com/shaneharper/vim-rtags</a> <a href="https://github.com/mattn/vim-rtags">https://github.com/mattn/vim-rtags</a>
</p>

<p>
Note to those maintainers. If you need RTags to behave differently or add features to make these other integration’s easier (like produce output in other formats etc), just drop us a note.
</p>

<p>
这些维护者请注意，如果需要 RTags 有所不同或添加功能让这些其他集成更简单（比如产生其他格式输出），请给我们留言。
</p>
</div>
</div>

<div id="outline-container-orgab9eb04" class="outline-2">
<h2 id="orgab9eb04"><span class="section-number-2">13</span> Disclaimer（免责声明）</h2>
<div class="outline-text-2" id="text-13">
<p>
RTags is still under development and is not the most stable piece of software you’ll ever find. We’re constantly working to improve on it.
</p>

<p>
RTags 仍处于开发阶段，你会发现它并不是最稳定的软件。我们正为了改进它坚持不懈的工作。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: liushangliang</p>
<p class="email">Email: <a href="mailto:phenix3443+github@gmail.com">phenix3443+github@gmail.com</a></p>
<p class="date">Created: 2020-03-05 四 17:01</p>
<p class="validation"></p>
</div>
</body>
</html>
